index.html
<div id="outline-container-orgcf083b6" class="outline-2">
<h2 id="orgcf083b6">Day 2 <code>haskell</code></h2>
<div class="outline-text-2" id="text-orgcf083b6">
</div>
<div id="outline-container-orgda2b18e" class="outline-3">
<h3 id="orgda2b18e">puzzle 1 <code>haskell</code></h3>
<div class="outline-text-3" id="text-orgda2b18e">
<blockquote>
<p>
For example, the record of a few games might look like this:
</p>

<ul class="org-ul">
<li>Game 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green</li>
<li>Game 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue</li>
<li>Game 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red</li>
<li>Game 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red</li>
<li>Game 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green</li>
</ul>

<p>
In game 1, three sets of cubes are revealed from the bag (and then put back again).
The first set is 3 blue cubes and 4 red cubes;
the second set is 1 red cube, 2 green cubes, and 6 blue cubes;
the third set is only 2 green cubes.
</p>

<p>
The Elf would first like to know which games would have been possible if the bag contained only 12 red cubes, 13 green cubes, and 14 blue cubes?
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell" id="org7dd4d5d"><span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Game 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green</span>
<span style="color: #98be65;">Game 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue</span>
<span style="color: #98be65;">Game 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red</span>
<span style="color: #98be65;">Game 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red</span>
<span style="color: #98be65;">Game 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green"</span> &gt; day2-data.txt
</pre>
</div>


<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #51afef;">import</span> <span style="color: #ECBE7B;">Data.Char</span> (isDigit, isSpace)
<span style="color: #51afef;">import</span> <span style="color: #ECBE7B;">Data.Text</span> (split, pack, unpack)
<span style="color: #51afef;">import</span> <span style="color: #ECBE7B;">System.IO.Unsafe</span> (unsafePerformIO)

<span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">Color</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Red</span> <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">Green</span> <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">Blue</span> <span style="color: #51afef;">deriving</span> (<span style="color: #ECBE7B;">Show</span>, <span style="color: #ECBE7B;">Eq</span>)

<span style="color: #c678dd;">leqMaxRead</span> <span style="color: #dcaeea;">=</span> (<span style="color: #dcaeea;">&lt;=</span> <span style="color: #da8548; font-weight: bold;">12</span>)
<span style="color: #c678dd;">leqMaxGreen</span> <span style="color: #dcaeea;">=</span> (<span style="color: #dcaeea;">&lt;=</span> <span style="color: #da8548; font-weight: bold;">13</span>)
<span style="color: #c678dd;">leqMaxBlue</span> <span style="color: #dcaeea;">=</span> (<span style="color: #dcaeea;">&lt;=</span> <span style="color: #da8548; font-weight: bold;">14</span>)

<span style="color: #c678dd;">games</span> <span style="color: #dcaeea;">=</span> lines <span style="color: #dcaeea;">$</span> unsafePerformIO (readFile <span style="color: #98be65;">"day2-data.txt"</span>)

<span style="color: #c678dd;">getGameIds</span> <span style="color: #dcaeea;">=</span> map (<span style="color: #dcaeea;">\</span>line <span style="color: #dcaeea;">-&gt;</span> read (takeWhile isDigit <span style="color: #dcaeea;">$</span> drop <span style="color: #da8548; font-weight: bold;">5</span> line) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Int</span>)

<span style="color: #c678dd;">splitGames</span> <span style="color: #dcaeea;">=</span> map (split (<span style="color: #dcaeea;">==</span><span style="color: #98be65;">','</span>)) <span style="color: #dcaeea;">.</span> split (<span style="color: #dcaeea;">==</span><span style="color: #98be65;">';'</span>) <span style="color: #dcaeea;">.</span> pack <span style="color: #dcaeea;">.</span> drop <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">.</span> dropWhile isDigit <span style="color: #dcaeea;">.</span> drop <span style="color: #da8548; font-weight: bold;">5</span>

<span style="color: #c678dd;">g</span> xs <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">case</span> xs <span style="color: #51afef;">of</span> <span style="color: #98be65;">"red"</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Red</span>; <span style="color: #98be65;">"green"</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Green</span>; <span style="color: #98be65;">"blue"</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Blue</span>; otherwise <span style="color: #dcaeea;">-&gt;</span> error <span style="color: #98be65;">"fuck"</span>

<span style="color: #c678dd;">f</span> xs <span style="color: #dcaeea;">=</span> ((read (takeWhile isDigit c) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Int</span>), g z) <span style="color: #51afef;">where</span> c <span style="color: #dcaeea;">=</span> dropWhile isSpace xs; z <span style="color: #dcaeea;">=</span> dropWhile (<span style="color: #dcaeea;">\</span>c <span style="color: #dcaeea;">-&gt;</span> (isDigit c) <span style="color: #dcaeea;">||</span> (isSpace c)) xs

<span style="color: #c678dd;">q</span> (v, c) <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">case</span> c <span style="color: #51afef;">of</span> <span style="color: #ECBE7B;">Red</span> <span style="color: #dcaeea;">-&gt;</span> leqMaxRead v; <span style="color: #ECBE7B;">Green</span> <span style="color: #dcaeea;">-&gt;</span> leqMaxGreen v; <span style="color: #ECBE7B;">Blue</span> <span style="color: #dcaeea;">-&gt;</span> leqMaxBlue v

<span style="color: #c678dd;">fuu</span> <span style="color: #dcaeea;">=</span> zip (getGameIds games) (map (all (<span style="color: #dcaeea;">==</span><span style="color: #ECBE7B;">True</span>)) <span style="color: #dcaeea;">$</span> (map <span style="color: #dcaeea;">$</span> map (all (<span style="color: #dcaeea;">==</span><span style="color: #ECBE7B;">True</span>)) ) <span style="color: #dcaeea;">$</span> (map <span style="color: #dcaeea;">$</span> map <span style="color: #dcaeea;">$</span> map (q <span style="color: #dcaeea;">.</span> f <span style="color: #dcaeea;">.</span> unpack)) (map splitGames games))

<span style="color: #c678dd;">sum</span> [value <span style="color: #dcaeea;">|</span> (value, predicate) <span style="color: #dcaeea;">&lt;-</span> fuu, predicate]
</pre>
</div>

<pre class="example">
8
</pre>
</div>
</div>
<div id="outline-container-org5a1e365" class="outline-3">
<h3 id="org5a1e365">puzzle 2 <code>haskell</code></h3>
<div class="outline-text-3" id="text-org5a1e365">
<blockquote>
<p>
For each game, find the minimum set of cubes that must have been present. What is the sum of the power of these sets?
</p>
</blockquote>


<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #c678dd;">biz</span> <span style="color: #dcaeea;">=</span> [[ map (f <span style="color: #dcaeea;">.</span> unpack) p <span style="color: #dcaeea;">|</span> p <span style="color: #dcaeea;">&lt;-</span> g] <span style="color: #dcaeea;">|</span> g <span style="color: #dcaeea;">&lt;-</span> map splitGames games]
<span style="color: #c678dd;">newData</span> <span style="color: #dcaeea;">=</span> map concat biz

<span style="color: #c678dd;">findMaxRGB</span> o<span style="color: #dcaeea;">@</span>(r, g, b) (v, c) <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">case</span> c <span style="color: #51afef;">of</span> <span style="color: #ECBE7B;">Red</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">if</span> r <span style="color: #dcaeea;">&lt;</span> v <span style="color: #51afef;">then</span> (v, g, b) <span style="color: #51afef;">else</span> o; <span style="color: #ECBE7B;">Green</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">if</span> g <span style="color: #dcaeea;">&lt;</span> v <span style="color: #51afef;">then</span> (r, v, b) <span style="color: #51afef;">else</span> o; <span style="color: #ECBE7B;">Blue</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">if</span> b <span style="color: #dcaeea;">&lt;</span> v <span style="color: #51afef;">then</span> (r, g, v) <span style="color: #51afef;">else</span> o

<span style="color: #c678dd;">recHelper</span> o<span style="color: #dcaeea;">@</span>(r, g, b) xs <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> null xs <span style="color: #51afef;">then</span> o <span style="color: #51afef;">else</span> recHelper (findMaxRGB o (head xs)) (tail xs)

sum <span style="color: #c678dd;">$</span> map ((<span style="color: #dcaeea;">\</span>(a, b, c) <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">*</span> b <span style="color: #dcaeea;">*</span> c) <span style="color: #dcaeea;">.</span> recHelper (<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">0</span>)) newData
</pre>
</div>

<pre class="example">
2286
</pre>
</div>
</div>
</div>
