index.org
** puzzle 1

#+begin_quote
The engineer explains that an engine part seems to be missing from the engine, but nobody can figure out which one. If you can add up all the part numbers in the engine schematic, it should be easy to work out which part is missing.

The engine schematic (your puzzle input) consists of a visual representation of the engine. There are lots of numbers and symbols you don't really understand, but apparently any number adjacent to a symbol, even diagonally, is a "part number" and should be included in your sum. (Periods (.) do not count as a symbol.)

Here is an example engine schematic:
#+end_quote

#+begin_src python :exports code :results none :session day3
data = """
467..114..
...*......
..35..633.
......#...
617*......
.....+.58.
..592.....
......755.
...$.*....
.664.598.."""

data = data[1:]
#+end_src

#+begin_quote
What is the sum of all of the part numbers in the engine schematic?
#+end_quote

#+name: day3p1
#+begin_src python :exports bothe :results output :session day3
from itertools import chain


predicate = lambda c: not c.isdigit() and c != '.'

symbol_coordinates = list(chain.from_iterable(
    [[(ln, pos) for pos, c in enumerate(line) if predicate(c)]
     for ln, line in enumerate(data.split())]
))

print(f"{symbol_coordinates = }")

digit_coordinates = list(chain.from_iterable(
    [[(ln, i) for i, c in enumerate(line) if c.isdigit()]
     for ln, line in enumerate(data.split())]
))

print(f"{digit_coordinates = }")

# current_y = digit_coordinates[0][0]
# current_x = digit_coordinates[0][1]
# temp = 0
# new_vec = []
# for e in digit_coordinates[1:]:

a = [b for a, b in digit_coordinates]

ofset = list(map(lambda x: len(x) + 1,
             ''.join(map(lambda x: str(int(x[0] + 1 == x[1])),
                         zip(a, a[1:]))).split('0')
        ))

# TODO if num lenght != 1 add ofset
#+end_src

#+RESULTS: day3p1
: symbol_coordinates = [(1, 3), (3, 6), (4, 3), (5, 5), (8, 3), (8, 5)]
: digit_coordinates = [(0, 0), (0, 1), (0, 2), (0, 5), (0, 6), (0, 7), (2, 2), (2, 3), (2, 6), (2, 7), (2, 8), (4, 0), (4, 1), (4, 2), (5, 7), (5, 8), (6, 2), (6, 3), (6, 4), (7, 6), (7, 7), (7, 8), (9, 1), (9, 2), (9, 3), (9, 5), (9, 6), (9, 7)]
