index.html
<div id="outline-container-org29961d2" class="outline-2">
<h2 id="org29961d2">Day 3</h2>
<div class="outline-text-2" id="text-org29961d2">
</div>
<div id="outline-container-orgeb1ffc4" class="outline-3">
<h3 id="orgeb1ffc4">puzzle 1</h3>
<div class="outline-text-3" id="text-orgeb1ffc4">
<blockquote>
<p>
The engineer explains that an engine part seems to be missing from the engine, but nobody can figure out which one. If you can add up all the part numbers in the engine schematic, it should be easy to work out which part is missing.
</p>

<p>
The engine schematic (your puzzle input) consists of a visual representation of the engine. There are lots of numbers and symbols you don&rsquo;t really understand, but apparently any number adjacent to a symbol, even diagonally, is a &ldquo;part number&rdquo; and should be included in your sum. (Periods (.) do not count as a symbol.)
</p>

<p>
Here is an example engine schematic:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">data</span> = <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">467..114..</span>
<span style="color: #98be65;">...*......</span>
<span style="color: #98be65;">..35..633.</span>
<span style="color: #98be65;">......#...</span>
<span style="color: #98be65;">617*......</span>
<span style="color: #98be65;">.....+.58.</span>
<span style="color: #98be65;">..592.....</span>
<span style="color: #98be65;">......755.</span>
<span style="color: #98be65;">...$.*....</span>
<span style="color: #98be65;">.664.598.."""</span>

<span style="color: #dcaeea;">data</span> = data[<span style="color: #da8548; font-weight: bold;">1</span>:]
</pre>
</div>

<blockquote>
<p>
What is the sum of all of the part numbers in the engine schematic?
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-python" id="org3ccb084"><span style="color: #51afef;">from</span> itertools <span style="color: #51afef;">import</span> chain


<span style="color: #dcaeea;">predicate</span> = <span style="color: #51afef;">lambda</span> <span style="color: #dcaeea;">c</span>: <span style="color: #51afef;">not</span> c.isdigit() <span style="color: #51afef;">and</span> c != <span style="color: #98be65;">'.'</span>

<span style="color: #dcaeea;">symbol_coordinates</span> = <span style="color: #c678dd;">list</span>(chain.from_iterable(
    [[(ln, pos) <span style="color: #51afef;">for</span> pos, c <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(line) <span style="color: #51afef;">if</span> predicate(c)]
     <span style="color: #51afef;">for</span> ln, line <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(data.split())]
))

<span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"</span>{symbol_coordinates = }<span style="color: #98be65;">"</span>)

digit_coordinates = <span style="color: #c678dd;">list</span>(chain.from_iterable(
    [[(ln, i) <span style="color: #51afef;">for</span> i, c <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(line) <span style="color: #51afef;">if</span> c.isdigit()]
     <span style="color: #51afef;">for</span> ln, line <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(data.split())]
))

<span style="color: #c678dd;">print</span>(f<span style="color: #98be65;">"</span>{digit_coordinates = }<span style="color: #98be65;">"</span>)

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">current_y = digit_coordinates[0][0]</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">current_x = digit_coordinates[0][1]</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">temp = 0</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">new_vec = []</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">for e in digit_coordinates[1:]:</span>

a = [b <span style="color: #51afef;">for</span> a, b <span style="color: #51afef;">in</span> digit_coordinates]

ofset = <span style="color: #c678dd;">list</span>(<span style="color: #c678dd;">map</span>(<span style="color: #51afef;">lambda</span> x: <span style="color: #c678dd;">len</span>(x) + <span style="color: #da8548; font-weight: bold;">1</span>,
             <span style="color: #98be65;">''</span>.join(<span style="color: #c678dd;">map</span>(<span style="color: #51afef;">lambda</span> x: <span style="color: #c678dd;">str</span>(<span style="color: #c678dd;">int</span>(x[<span style="color: #da8548; font-weight: bold;">0</span>] + <span style="color: #da8548; font-weight: bold;">1</span> == x[<span style="color: #da8548; font-weight: bold;">1</span>])),
                         <span style="color: #c678dd;">zip</span>(a, a[<span style="color: #da8548; font-weight: bold;">1</span>:]))).split(<span style="color: #98be65;">'0'</span>)
        ))

<span style="color: #5B6268;"># </span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #5B6268;"> if num lenght != 1 add ofset</span>
</pre>
</div>

<pre class="example">
symbol_coordinates = [(1, 3), (3, 6), (4, 3), (5, 5), (8, 3), (8, 5)]
digit_coordinates = [(0, 0), (0, 1), (0, 2), (0, 5), (0, 6), (0, 7), (2, 2), (2, 3), (2, 6), (2, 7), (2, 8), (4, 0), (4, 1), (4, 2), (5, 7), (5, 8), (6, 2), (6, 3), (6, 4), (7, 6), (7, 7), (7, 8), (9, 1), (9, 2), (9, 3), (9, 5), (9, 6), (9, 7)]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Felix Drees</p>
<p class="date">Created: 2023-12-19 Di 16:56</p>
</div>
</body>
</html>